![logo_ironhack_blue 7](https://user-images.githubusercontent.com/23629340/40541063-a07a0a8a-601a-11e8-91b5-2f13e4e6b441.png)

# Lab | SQL Queries 9

### Instructions

In this lab we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

- Create a table `rentals_may` to store the data from rental table with information for the month of May.
- Insert values in the table `rentals_may` using the table rental, filtering values only for the month of May.
- Create a table `rentals_june` to store the data from rental table with information for the month of June.
- Insert values in the table `rentals_june` using the table rental, filtering values only for the month of June.
- Check the number of rentals for each customer for May.
- Check the number of rentals for each customer for June.

In [1]:
# All of the above done in MySQL Workbench

- Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

  - Check the number of rentals for each customer for May
  - Check the number of rentals for each customer for June

    **Hint**: You can store the results from the two queries in two separate dataframes.

In [2]:
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [3]:
# this is the general syntax 'dialect+driver://username:password@host:port/database'
# to create the connection string

connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'

engine = create_engine(connection_string)
# data = pd.read_sql_query('SELECT * FROM bank.loan', engine)
# data.head()

In [4]:
engine.execute("use sakila")

query1 = 'select customer_id, count(*) as number_of_rentals \
from rentals_may \
group by customer_id \
order by number_of_rentals desc'

query2 = 'select customer_id, count(*) as number_of_rentals \
from rentals_june \
group by customer_id \
order by number_of_rentals desc'

data1 = pd.read_sql_query(query1, engine)
data2 = pd.read_sql_query(query2, engine)

In [5]:
data1.head()

   customer_id  number_of_rentals
0          197                  8
1          109                  7
2          506                  7
3           19                  6
4           53                  6

In [6]:
data2.head()

   customer_id  number_of_rentals
0           31                 11
1          454                 10
2          213                  9
3          267                  9
4          295                  9

- Write a function that checks if customer borrowed more or less books in the month of June as compared to May.

  **Hint**: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the [merge function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html).

In [7]:
# Returns the name of the month where the greater amouunt of movies where rented.
# The argument is the customer_id
def check_rentals(customer):
    data3 = data1.merge(data2,on='customer_id')
    data3 = data3.sort_values(by=['customer_id'])
    
    try:
        nx = data3.loc[data3['customer_id']==customer, 'number_of_rentals_x'].values[0]
        ny = data3.loc[data3['customer_id']==customer, 'number_of_rentals_y'].values[0]
        if nx > ny:
            return 'Customer ' + str(customer) + ': May. ' + str(ny) + ' movies rented.'
        elif nx < ny:
            return 'Customer ' + str(customer) + ': June. ' + str(ny) + ' movies rented.'
        else:
            return 'Same amount of movies rented both months.'
    except:
        return 'No customer_id = ' + str(customer) + ' found.'

In [8]:
# Check the functions with some random customers

# Customer_id 3 rented more movies on June
print(check_rentals(3))

# Customer_id 14 rented more movies on May
print(check_rentals(14))

# There's no customer_id 1000
print(check_rentals(1000))

Customer 3: June. 4 movies rented.
Customer 14: May. 1 movies rented.
No customer_id = 1000 found.